Revit 2026 API

# CityLongitude Property

---

Longitude of the city

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Longitude { get; }
```
```vb
Public ReadOnly Property Longitude As Double
	Get
```
```cpp
public:
property double Longitude {
	double get ();
}
```
```fsharp
member Longitude : float with get
```

#### Property Value

Double

A read only property that contains the longitude of the city. The value returned is in radians, ranging from -PI to +PI.

#### Reference

City Class

Autodesk.Revit.DB Namespace